In [1]:
import pandas as pd
import numpy as np

In [3]:
sozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Elif"],
          "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
          "Kalori" : [100,200,300,400]
          }

In [5]:
dataFrame1 = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [7]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Elif  Basketbol     400

In [9]:
sozluk2 = {"Isim" : ["Osman", "Levent", "Atlas", "Fatma"],
          "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
          "Kalori" : [200,100,50,300]
          }

In [11]:
dataFrame2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [13]:
sozluk3 = {"Isim" : ["Ayşe", "Mahmut", "Duygu", "Nur"],
          "Spor" : ["Koşu", "Yüzme", "Badminton", "Basketbol"],
          "Kalori" : [300,400,500,250]
          }

In [15]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [17]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [19]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur  Basketbol     250

## concatenation

In [24]:
pd.concat([dataFrame1, dataFrame2, dataFrame3], axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Elif  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur  Basketbol     250

## merge

In [27]:
mergeSozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Elif"],
               "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"]
               }

In [29]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [31]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Elif  Basketbol

In [33]:
mergeSozluk2 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Elif"],
               "Kalori" : [100,200,250,150]
               }

In [35]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [39]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     250
3    Elif     150

In [41]:
pd.merge(mergeDataFrame1, mergeDataFrame2, on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     250
3    Elif  Basketbol     150

In [43]:
maasSozluk = { "Isim" : ["Elif", "Zeynep", "Mehmet", "Ahmet"],
             "Departman" : ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
             "Maas" : [200,300,400,500]
             }

In [45]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [47]:
maasDataFrame

     Isim  Departman  Maas
0    Elif    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [51]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [53]:
maasDataFrame["Departman"].nunique()

3

In [55]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [67]:
def bruttenNete(maas):
    return maas * 0.66

In [69]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [71]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [81]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
              "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
              "Karakter Yas" : [9,10,50,20,10]
              }

In [83]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [85]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [95]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   15.0
                Homer                  50.0
South Park      Cartman                 9.0
                Kenny                  10.0

In [93]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"], aggfunc = np.sum)

/var/folders/vl/y05ys0v56dn5q1kzqq_nx1c80000gn/T/ipykernel_12709/1730369034.py:1: FutureWarning: The provided callable <function sum at 0x112d45bc0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"], aggfunc = np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10